# ** Dockerfile: 프로그램을 실행하는 데에 필요한 명령어들을 기입하는 곳임. 이미지 만들 때 사용하는 설명서라고 보면 됨 **

# FROM: 도커 파일의 시작점
# - 특정 이미지를 불러와서 그 이미지의 완성된 내용을 바탕으로 시작하는거임 
# - 객체 지향 프로그래밍의 상속이랑 비슷한 개념이라고 보면 될듯
FROM node:20-slim

# WORKDIR: 이미지의 작업 디렉토리를 설정
# - 디렉토리가 없으면 새로 생성
# - 생성과 동시에 해당 디렉토리로 이동
# - cd 명령어하고 비슷한 느낌
WORKDIR /app 

# COPY: 현재 내 컴퓨터의 파일을 생성될 이미지에 복사하고 싶을 때 사용하는 명령어 
# - COPY [호스트 경로] [이미지의 작업 디렉토리] 
COPY . .

# RUN: 터미널 명령어를 실행시키고 싶을 때 사용
# - 이미지 빌드 단계에서 실행되는 명령어 
RUN ["npm", "install"]

# EXPOSE: 몇 번 포트를 사용할 지 명시해두는 용도 
EXPOSE 3000

# CMD: 마지막 터미널 명령어일 경우에은 RUN 대신 CMD를 사용
# - 빌드 완료 후, 최종적인 실행 단계에서 실행되는 명령어 
# - 비슷한 걸로 ENTRYPOINT 명령어가 있는데, 차이점은 명령어를 덧씌워서 사용할 수 있냐 없냐의 차이 (CMD O, ENTRYPOINT X)
CMD ["node", "index.js"]


